In [1]:
import pandas as pd

‚ö° **SERIES:** \
Imagine que voc√™ tem uma lista de n√∫meros, por exemplo: [10, 20, 30, 40, 50]. Uma lista comum em Python n√£o possui r√≥tulos, √© apenas uma sequ√™ncia de valores. Agora, se voc√™ quiser associar um r√≥tulo a cada valor, como "A", "B", "C", "D" e "E", para que cada n√∫mero tenha um nome, voc√™ poderia usar uma Series
> serie = pd.Series(dados, index)

In [2]:
serieCreate = pd.Series(['Beto', 'Patrick', 'Julio'], ['A', 'B', 'C'])

display(serieCreate)

labelA = serieCreate['A'] # Obter dado atrav√©s do Indice(rotulo)
labelAB = serieCreate[['A', 'B']] # Obter dados atrav√©s do Indice(rotulo)

A       Beto
B    Patrick
C      Julio
dtype: object

üîÄ **DE SERIES PARA DATAFRAME:**
> üîπ serieCreate[['A', 'B']] -> utilizando [['xxxyyy']]
> 
> üîπ display(coluna_A.to_frame()) -> utilizando o metodo to_frame()

‚ùÑÔ∏è **CRIANDO DATAFRAME:**

In [3]:
from numpy.random import randn

# randn(linhas, columns) -> gerar numeros 

df = pd.DataFrame(randn(5, 5), index=['A', 'B' , 'C', 'D', 'E'], columns=["Y", 'Z', 'W','X', 'Q'])

display(df)

          Y         Z         W         X         Q
A -0.807562  1.048870 -0.070832 -0.201138  0.892871
B -0.762434 -1.330139 -0.151765 -0.229694 -0.764902
C -0.297130 -0.437388  0.903902  0.566592 -0.424399
D  0.875576  0.182787 -0.119280  1.145204  0.713865
E  1.423925 -0.140154 -0.341077 -1.271933 -0.186565

In [4]:
display(df['Y']) # Obter dados atraves da Coluna. DType:return series
display(df[['Y']]) # Obter dados atraves da Coluna. DType:return DataFrame

A   -0.807562
B   -0.762434
C   -0.297130
D    0.875576
E    1.423925
Name: Y, dtype: float64

          Y
A -0.807562
B -0.762434
C -0.297130
D  0.875576
E  1.423925

‚òÑÔ∏è **Criando uma nova coluna e preenchendo com dados existentes da coluna Y:**

In [5]:
df['new'] = df['Y']
display(df)

          Y         Z         W         X         Q       new
A -0.807562  1.048870 -0.070832 -0.201138  0.892871 -0.807562
B -0.762434 -1.330139 -0.151765 -0.229694 -0.764902 -0.762434
C -0.297130 -0.437388  0.903902  0.566592 -0.424399 -0.297130
D  0.875576  0.182787 -0.119280  1.145204  0.713865  0.875576
E  1.423925 -0.140154 -0.341077 -1.271933 -0.186565  1.423925

üåü  **Criando uma nova coluna e preenchendo com a SOMA dos dados de colunas existentes:**

In [6]:
df['sum'] = df['W'] + df['X']
df

          Y         Z         W         X         Q       new       sum
A -0.807562  1.048870 -0.070832 -0.201138  0.892871 -0.807562 -0.271970
B -0.762434 -1.330139 -0.151765 -0.229694 -0.764902 -0.762434 -0.381459
C -0.297130 -0.437388  0.903902  0.566592 -0.424399 -0.297130  1.470493
D  0.875576  0.182787 -0.119280  1.145204  0.713865  0.875576  1.025924
E  1.423925 -0.140154 -0.341077 -1.271933 -0.186565  1.423925 -1.613010

‚ùå **DELETANDO UMA DETERMINADA COLUNA**
> O m√©todo df.drop() n√£o altera o DataFrame df original. Ele retorna uma nova c√≥pia do DataFrame sem a coluna 'Y'. Quando utiliz√°-lo, insira para um novo DataFrame.
> 
> Para alterar o DataFrame Original, utilize o par√¢metro: df.drop(inplace=True)

In [7]:
df_Modified = df.drop('Y', axis=1).drop('A', axis=0) # eixo 1 = Colunas -- eixo 0 = Linhas
df_Modified

          Z         W         X         Q       new       sum
B -1.330139 -0.151765 -0.229694 -0.764902 -0.762434 -0.381459
C -0.437388  0.903902  0.566592 -0.424399 -0.297130  1.470493
D  0.182787 -0.119280  1.145204  0.713865  0.875576  1.025924
E -0.140154 -0.341077 -1.271933 -0.186565  1.423925 -1.613010

üî± **Acessar linhas e c√©lulas com o M√©todo loc[] --baseado-- em etiquetas:**
> üîπ usado para sele√ß√£o baseada em etiquetas. Isso significa que voc√™ especifica as linhas e colunas que deseja acessar usando r√≥tulos de √≠ndice, em vez de n√∫meros inteiros de posi√ß√£o.

In [8]:
df.loc[['D']] # Visualizando dados DA LINHA 'D' em DataFrame
df.loc[['D', 'C']] # DataFrame da Linha 'D' e 'C'
df.loc['D', 'sum'] # Selecionando uma c√©lula especifica
df.loc[:, 'Q'] # Selecionar uma coluna por r√≥tulo -> IGUAL A: df[['Q']]
df.loc[['D', 'C'], ['new']] # linhas D e C na coluna new -> return celulas em DF
df.loc['C':'D','W':'Q']

          W         X         Q
C  0.903902  0.566592 -0.424399
D -0.119280  1.145204  0.713865

üî± **Acessar linhas e c√©lulas com o M√©todo iloc[] --baseado-- em posi√ß√£o:**
> üîπ usado para sele√ß√£o baseada em posi√ß√£o. Isso significa que voc√™ especifica as linhas e colunas que deseja acessar usando √≠ndices inteiros.

In [9]:
df.iloc[:3, 2:-1]

          W         X         Q       new
A -0.070832 -0.201138  0.892871 -0.807562
B -0.151765 -0.229694 -0.764902 -0.762434
C  0.903902  0.566592 -0.424399 -0.297130

üî∞ **FILTROS: SELE√á√ÉO CONDICIONAL**

In [10]:
df[df['W'] > 0]  # retorna um novo DataFrame contendo apenas as linhas onde o valor na coluna "W" √© maior que zero.

         Y         Z         W         X         Q      new       sum
C -0.29713 -0.437388  0.903902  0.566592 -0.424399 -0.29713  1.470493

In [11]:
df[(df['W'] > 0) & (df['Q'] > 1)]

Empty DataFrame
Columns: [Y, Z, W, X, Q, new, sum]
Index: []

„ÄΩÔ∏è **MANIPULAR INDICES:**

In [12]:
df.reset_index(inplace=True) # redefine o indice para um novo indice num√©rico e move o anterior como coluna.
df

  index         Y         Z         W         X         Q       new       sum
0     A -0.807562  1.048870 -0.070832 -0.201138  0.892871 -0.807562 -0.271970
1     B -0.762434 -1.330139 -0.151765 -0.229694 -0.764902 -0.762434 -0.381459
2     C -0.297130 -0.437388  0.903902  0.566592 -0.424399 -0.297130  1.470493
3     D  0.875576  0.182787 -0.119280  1.145204  0.713865  0.875576  1.025924
4     E  1.423925 -0.140154 -0.341077 -1.271933 -0.186565  1.423925 -1.613010

In [13]:
df.set_index('index', inplace=True)
df

              Y         Z         W         X         Q       new       sum
index
A     -0.807562  1.048870 -0.070832 -0.201138  0.892871 -0.807562 -0.271970
B     -0.762434 -1.330139 -0.151765 -0.229694 -0.764902 -0.762434 -0.381459
C     -0.297130 -0.437388  0.903902  0.566592 -0.424399 -0.297130  1.470493
D      0.875576  0.182787 -0.119280  1.145204  0.713865  0.875576  1.025924
E      1.423925 -0.140154 -0.341077 -1.271933 -0.186565  1.423925 -1.613010

üî± **Hierarquia de √≠ndices e √≠ndices M√∫ltiplos**

In [14]:
outside = ['H', 'H','M', 'M']
inside = [1, 2, 1, 2]

hierq_ind = list(zip(outside, inside))

print(hierq_ind)

[('H', 1), ('H', 2), ('M', 1), ('M', 2)]

In [15]:
# transformar em um objeto MultiIndex. Usado como um √≠ndice em um DataFrame do pandas para criar uma estrutura de √≠ndice hier√°rquico.
hierq_ind = pd.MultiIndex.from_tuples(hierq_ind)

In [16]:
df3 = pd.DataFrame(randn(4, 2), index=hierq_ind, columns='A B'.split())
df3

            A         B
H 1  1.842272 -0.170269
  2  0.227541  0.092891
M 1 -1.084475 -0.653683
  2 -0.895198  0.160468

In [17]:
# para renomear esse indices novos criados:
df3.index.names = ['G√™nero', 'N√∫mero']
df3

                      A         B
G√™nero N√∫mero
H      1       1.842272 -0.170269
       2       0.227541  0.092891
M      1      -1.084475 -0.653683
       2      -0.895198  0.160468

In [18]:
# BUSCAS E SELE√á√ÉO:

df3.loc['M'].loc[:, ['A']]
df3.loc['M'].loc[[2]]
df3.loc['M']

               A         B
N√∫mero
1      -1.084475 -0.653683
2      -0.895198  0.160468

> ‚¨áÔ∏è sele√ß√£o das linhas do DataFrame df3 onde o valor do n√≠vel "level='nomeIndiceAqui' √© igual a x. Isso retorna um novo DataFrame ou uma s√©rie, dependendo do contexto em que √© usado, contendo apenas as linhas correspondentes a essa condi√ß√£o.

In [19]:
df3.xs(2, level='N√∫mero')

               A         B
G√™nero
H       0.227541  0.092891
M      -0.895198  0.160468

‚ùå **TRATAMENTOS DE DADOS AUSENTES:**

üß∂
> O m√©todo dropna() em Pandas √© usado para remover valores ausentes (NaN) de um DataFrame ou S√©rie.

> Aprenda o df.dropna():
https://bit.ly/3Rnp5GF

In [20]:
import numpy as np

# Criando uma Df com celulas NaN
df_nan = pd.DataFrame({'A': [22734, np.nan, np.nan],'B': [334, 56, np.nan],'C': [5673, 55, np.nan],})
display(df_nan)

         A      B       C
0  22734.0  334.0  5673.0
1      NaN   56.0    55.0
2      NaN    NaN     NaN

In [21]:
df_nan.dropna(axis=1, thresh=0)

         A      B       C
0  22734.0  334.0  5673.0
1      NaN   56.0    55.0
2      NaN    NaN     NaN

üß∂
> O m√©todo fillna() em Pandas √© usado para preencher os valores ausentes (NaN) em um DataFrame ou S√©rie com valores espec√≠ficos que voc√™ fornece.

> Aprenda o df.fillna():
https://bit.ly/45NByaN

In [22]:
df_nan.fillna(0) # Substitua os NaN por 0.

         A      B       C
0  22734.0  334.0  5673.0
1      0.0   56.0    55.0
2      0.0    0.0     0.0

In [23]:
df_nan[['B']].fillna(value=df_nan['B'].mean()) # Substitue o NaN da coluna ou linha pela m√©dia

       B
0  334.0
1   56.0
2  195.0

In [24]:
df_nan.ffill() #  preenche os valores ausentes usando o valor da c√©lula imediatamente acima na mesma coluna.

         A      B       C
0  22734.0  334.0  5673.0
1  22734.0   56.0    55.0
2  22734.0   56.0    55.0

üß† **GROUP BY**
> Obs: em [sum(), mean()...] defina numeric_only=True, as fun√ß√µes aplicar√£o a opera√ß√£o apenas √†s colunas que cont√™m dados num√©ricos.

In [74]:
vendas_funcionario = {
    'Classe': ['Pleno', 'Senior', 'Junior', 'Senior', 'Pleno', 'Junior', 'Pleno', 'Senior', 'Junior', 'Pleno'],
    'Funcion√°rios': ['Beto', 'Larissa', 'Anderson', 'Lucas', 'Mariana', 'Jo√£o', 'Pedro', 'Isabela', 'Maria', 'Ricardo'],
    'Vendas': [1000, 1500, 800, 1200, 2000, 750, 1800, 1600, 850, 1700]
}

dfData = pd.DataFrame(vendas_funcionario)

In [91]:
# Qual foi o total de vendas por classe:

group = dfData.groupby('Classe').sum(numeric_only=True) 
group

        Vendas
Classe
Junior    2400
Pleno     6500
Senior    4300

**CONCAT**

In [97]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df_2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df_3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])